realmcu/HoneyRepo-driver-display/driver/lcdc/device/src/rtl8773e/rtl_lcdc_dbic_def.h
/**
*********************************************************************************************************
*               Copyright(c) 2023, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl_lcdc_dbic_def.h
* \brief    LCDC DBIC related definitions for RTL8762G
* \details
* \author
* \date     2023-11-15
* \version  v1.1
* *********************************************************************************************************
*/

#ifndef RTL_DBIC_DEF_H
#define RTL_DBIC_DEF_H

#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/*============================================================================*
 *                         DBIC Registers Memory Map
 *============================================================================*/
typedef struct
{
    __IO uint32_t  CTRLR0;                  /*!< 0x00 */
    __IO uint32_t  RX_NDF;                  /*!< 0x04 */
    __IO uint32_t  SSIENR;                  /*!< 0x08 */
    __IO uint32_t  RESERVED[1];             /*!< 0x0C */
    __IO uint32_t  SER;                     /*!< 0x10 */
    __IO uint32_t  BAUDR;                   /*!< 0x14 */
    __IO uint32_t  TXFTLR;                  /*!< 0x18 */
    __IO uint32_t  RXFTLR;                  /*!< 0x1C */
    __IO uint32_t  TXFLR;                   /*!< 0x20 */
    __IO uint32_t  RXFLR;                   /*!< 0x24 */
    __IO uint32_t  SR;                      /*!< 0x28 */
    __IO uint32_t  IMR;                     /*!< 0x2C */
    __IO uint32_t  ISR;                     /*!< 0x30 */
    __IO uint32_t  RISR;                    /*!< 0x34 */
    __IO uint32_t  TXOICR;                  /*!< 0x38 */
    __IO uint32_t  RXOICR;                  /*!< 0x3C */
    __IO uint32_t  RXUICR;                  /*!< 0x40 */
    __IO uint32_t  MSTICR;                  /*!< 0x44 */
    __IO uint32_t  ICR;                     /*!< 0x48 */
    __IO uint32_t  DMACR;                   /*!< 0x4C */
    __IO uint32_t  DMATDLR;                 /*!< 0x50 */
    __IO uint32_t  DMARDLR;                 /*!< 0x54 */
    __IO uint32_t  IDR;                     /*!< 0x58 */
    __IO uint32_t  SPIC_VERSION;            /*!< 0x5C */
    union
    {
        __IO uint8_t  byte;
        __IO uint16_t half;
        __IO uint32_t word;
    } DR[16];                               /*!< 0x60-0x9C */
    __IO uint32_t  DM_DR[16];               /*!< 0xA0-0xDC */
    __IO uint32_t  READ_FAST_SINGLE;        /*!< 0xE0 */
    __IO uint32_t  READ_DUAL_DATA;          /*!< 0xE4 */
    __IO uint32_t  READ_DUAL_ADDR_DATA;     /*!< 0xE8 */
    __IO uint32_t  READ_QUAD_DATA;          /*!< 0xEC */
    __IO uint32_t  READ_QUAD_ADDR_DATA;     /*!< 0xF0 */
    __IO uint32_t  WRITE_SINGLE;            /*!< 0xF4 */
    __IO uint32_t  WRITE_DUAL_DATA;         /*!< 0xF8 */
    __IO uint32_t  WRITE_DUAL_ADDR_DATA;    /*!< 0xFC */
    __IO uint32_t  WRITE_QUAD_DATA;         /*!< 0x100 */
    __IO uint32_t  WRITE_QUAD_ADDR_DATA;    /*!< 0x104 */
    __IO uint32_t  WRITE_ENABLE;            /*!< 0x108 */
    __IO uint32_t  READ_STATUS;             /*!< 0x10C */
    __IO uint32_t  CTRLR2;                  /*!< 0x110 */
    __IO uint32_t  FBAUDR;                  /*!< 0x114 */
    __IO uint32_t  USER_LENGTH;             /*!< 0x118 */
    __IO uint32_t  AUTO_LENGTH;             /*!< 0x11C */
    __IO uint32_t  VALID_CMD;               /*!< 0x120 */
    __IO uint32_t  FLASH_SIZE;              /*!< 0x124 */
    __IO uint32_t  FLUSH_FIFO;              /*!< 0x128 */
    __IO uint32_t  DUM_BYTE;                /*!< 0x12C */
    __IO uint32_t  TX_NDF;                  /*!< 0x130 */
    __IO uint32_t  DEVICE_INFO;             /*!< 0x134 */
    __IO uint32_t  TPR0;                    /*!< 0x138 */
    __IO uint32_t  AUTO_LENGTH2;            /*!< 0x13C */
    __IO uint32_t  TPR1;                    /*!< 0x140 */
    __IO uint32_t  RESERVED1[15];           /*!< 0x144-0x17C */
    __IO uint32_t  ST_DR[16];               /*!< 0x180-0x1BC */
    __IO uint32_t  STFLR;                   /*!< 0x1C0 */
    __IO uint32_t  RESERVED2[3];            /*!< 0x1C4-0x1CC */
    __IO uint32_t  PAGE_READ;               /*!< 0x1D0 */
} LCDC_DBIC_TypeDef;

/*============================================================================*
 *                         DBIC Declaration
 *============================================================================*/

/*============================================================================*
 *                         DBIC Registers and Field Descriptions
 *============================================================================*/
/* 0x00
    4:0     R/W    sipol                   0x1F
    5       R/W    sipol_en                0x0
    6       R/W    scph                    0x0
    7       R/W    scpol                   0x0
    9:8     R/W    tmod                    0x0
    10      R/W    gclk_dis                0x0
    12:11   R      reserved2               0x0
    15:13   R/W    ddr_en                  0x0
    17:16   R/W    addr_ch                 0x0
    19:18   R/W    data_ch                 0x0
    21:20   R/W    cmd_ch                  0x0
    22      R/W    fast_rd                 0x0
    27:23   R/W    ck_mtimes               0x2
    29:28   R      reserved1               0x0
    30      R/W    uar                     0x0
    31      R/W    user_mode               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t sipol: 5;
        uint32_t sipol_en: 1;
        uint32_t scph: 1;
        uint32_t scpol: 1;
        uint32_t tmod: 2;
        uint32_t gclk_dis: 1;
        const uint32_t reserved_1: 2;
        uint32_t ddr_en: 3;
        uint32_t addr_ch: 2;
        uint32_t data_ch: 2;
        uint32_t cmd_ch: 2;
        uint32_t fast_rd: 1;
        uint32_t ck_mtimes: 5;
        const uint32_t reserved_0: 2;
        uint32_t uar: 1;
        uint32_t user_mode: 1;
    } b;
} DBIC_CTRLR0_TypeDef;



