realmcu/HoneyRepo-driver-display/driver/lcdc/device/src/rtl8773e/rtl_lcdc_dbic_def.h
/* 0x04
    23:0    R/W    rx_ndf                  0x0
    31:24   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rx_ndf: 24;
        const uint32_t reserved_0: 8;
    } b;
} DBIC_RX_NDF_TypeDef;



/* 0x08
    0       R/W    spic_en                 0x0
    1       R/W    atck_cmd                0x0
    3:2     R      reserved2               0x0
    4       W      pgm_rst_test_en         0x0
    31:5    R      reserved1               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t spic_en: 1;
        uint32_t atck_cmd: 1;
        const uint32_t reserved_1: 2;
        uint32_t pgm_rst_test_en: 1;
        const uint32_t reserved_0: 27;
    } b;
} DBIC_SSIENR_TypeDef;



/* 0x10
    0       R/W    ser                     0x1
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t ser: 1;
        const uint32_t reserved_0: 31;
    } b;
} DBIC_SER_TypeDef;



/* 0x14
    11:0    R/W    sckdv                   0x6
    31:12   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t sckdv: 12;
        const uint32_t reserved_0: 20;
    } b;
} DBIC_BAUDR_TypeDef;



/* 0x18
    5: 0    R/W    tft                     0x0
    31:6    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t tft: 6;
        const uint32_t reserved_0: 26;
    } b;
} DBIC_TXFTLR_TypeDef;



/* 0x1C
    2: 0    R/W    rft                     0x7
    31:3    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rft: 3;
        const uint32_t reserved_0: 29;
    } b;
} DBIC_RXFTLR_TypeDef;



/* 0x20
    6: 0    R      txflr                   0x0
    31: 7   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t txflr: 7;
        const uint32_t reserved_0: 25;
    } b;
} DBIC_TXFLR_TypeDef;



/* 0x24
    3: 0    R      rxflr                   0x0
    31: 4   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t rxflr: 4;
        const uint32_t reserved_0: 28;
    } b;
} DBIC_RXFLR_TypeDef;



/* 0x28
    0       R      busy                    0x0
    1       R      tfnf                    0x1
    2       R      tfe                     0x1
    3       R      rfne                    0x0
    4       R      rff                     0x0
    5       R      txe                     0x0
    6       R      dcol                    0x0
    7       R      boot_fin                0x0
    8       R/W    atwr_rdsr_n             0x0
    31:9    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t busy: 1;
        const uint32_t tfnf: 1;
        const uint32_t tfe: 1;
        const uint32_t rfne: 1;
        const uint32_t rff: 1;
        const uint32_t txe: 1;
        const uint32_t dcol: 1;
        const uint32_t boot_fin: 1;
        uint32_t atwr_rdsr_n: 1;
        const uint32_t reserved_0: 23;
    } b;
} DBIC_SR_TypeDef;



/* 0x2C
    0       R/W    txeim                   0x0
    1       R/W    txoim                   0x1
    2       R/W    rxuim                   0x1
    3       R/W    rxoim                   0x1
    4       R/W    rxfim                   0x0
    5       R/W    fseim                   0x1
    6       R/W    wbeim                   0x1
    7       R/W    byeim                   0x1
    8       R/W    aceim                   0x1
    9       R/W    useim                   0x0
    10      R/W    tfsim                   0x0
    11      R/W    acsim                   0x0
    12      R/W    dreim                   0x0
    13      R/W    stuim                   0x0
    14      R/W    stoim                   0x0
    15      R/W    stfim                   0x0
    16      R/W    nweim                   0x0
    31:17   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t txeim: 1;
        uint32_t txoim: 1;
        uint32_t rxuim: 1;
        uint32_t rxoim: 1;
        uint32_t rxfim: 1;
        uint32_t fseim: 1;
        uint32_t wbeim: 1;
        uint32_t byeim: 1;
        uint32_t aceim: 1;
        uint32_t useim: 1;
        uint32_t tfsim: 1;
        uint32_t acsim: 1;
        uint32_t dreim: 1;
        uint32_t stuim: 1;
        uint32_t stoim: 1;
        uint32_t stfim: 1;
        uint32_t nweim: 1;
        const uint32_t reserved_0: 15;
    } b;
} DBIC_IMR_TypeDef;



/* 0x30
    0       R      txeis                   0x0
    1       R      txois                   0x0
    2       R      rxuis                   0x0
    3       R      rxois                   0x0
    4       R      rxfis                   0x0
    5       R      fseis                   0x0
    6       R      wbeis                   0x0
    7       R      byeis                   0x0
    8       R      aceis                   0x0
    9       R      useis                   0x0
    10      R      tfsis                   0x0
    11      R      acsis                   0x0
    12      R      dreis                   0x0
    13      R      stuis                   0x0
    14      R      stois                   0x0
    15      R      stfis                   0x0
    16      R      nweis                   0x0
    31:17   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t txeis: 1;
        const uint32_t txois: 1;
        const uint32_t rxuis: 1;
        const uint32_t rxois: 1;
        const uint32_t rxfis: 1;
        const uint32_t fseis: 1;
        const uint32_t wbeis: 1;
        const uint32_t byeis: 1;
        const uint32_t aceis: 1;
        const uint32_t useis: 1;
        const uint32_t tfsis: 1;
        const uint32_t acsis: 1;
        const uint32_t dreis: 1;
        const uint32_t stuis: 1;
        const uint32_t stois: 1;
        const uint32_t stfis: 1;
        const uint32_t nweis: 1;
        const uint32_t reserved_0: 15;
    } b;
} DBIC_ISR_TypeDef;



/* 0x34
    0       R      txeir                   0x0
    1       R      txoir                   0x0
    2       R      rxuir                   0x0
    3       R      rxoir                   0x0
    4       R      rxfir                   0x0
    5       R      fseir                   0x0
    6       R      wbeir                   0x0
    7       R      byeir                   0x0
    8       R      aceir                   0x0
    9       R      useir                   0x0
    10      R      tfsir                   0x0
    11      R      acsir                   0x0
    12      R      dreir                   0x0
    13      R      stuir                   0x0
    14      R      stoir                   0x0
    15      R      stfir                   0x0
    16      R      nweir                   0x0
    31:17   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t txeir: 1;
        const uint32_t txoir: 1;
        const uint32_t rxuir: 1;
        const uint32_t rxoir: 1;
        const uint32_t rxfir: 1;
        const uint32_t fseir: 1;
        const uint32_t wbeir: 1;
        const uint32_t byeir: 1;
        const uint32_t aceir: 1;
        const uint32_t useir: 1;
        const uint32_t tfsir: 1;
        const uint32_t acsir: 1;
        const uint32_t dreir: 1;
        const uint32_t stuir: 1;
        const uint32_t stoir: 1;
        const uint32_t stfir: 1;
        const uint32_t nweir: 1;
        const uint32_t reserved_0: 15;
    } b;
} DBIC_RISR_TypeDef;



