realmcu/HoneyRepo-driver-display/driver/lcdc/device/src/rtl8773e/rtl_lcdc_dbic_def.h
/* 0x38
    0       R/W    txoicr                  0x0
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t txoicr: 1;
        const uint32_t reserved_0: 31;
    } b;
} DBIC_TXOICR_TypeDef;



/* 0x3C
    0       R/W    rxoicr                  0x0
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rxoicr: 1;
        const uint32_t reserved_0: 31;
    } b;
} DBIC_RXOICR_TypeDef;



/* 0x40
    0       R/W    rxuicr                  0x0
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rxuicr: 1;
        const uint32_t reserved_0: 31;
    } b;
} DBIC_RXUICR_TypeDef;



/* 0x44
    0       R/W    msticr                  0x0
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t msticr: 1;
        const uint32_t reserved_0: 31;
    } b;
} DBIC_MSTICR_TypeDef;



/* 0x48
    0       R/W    icr                     0x0
    31:1    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t icr: 1;
        const uint32_t reserved_0: 31;
    } b;
} DBIC_ICR_TypeDef;



/* 0x4C
    0       R/W    rx_dmac_en              0x0
    1       R/W    tx_dmac_en              0x0
    31:2    R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rx_dmac_en: 1;
        uint32_t tx_dmac_en: 1;
        const uint32_t reserved_0: 30;
    } b;
} DBIC_DMACR_TypeDef;



/* 0x50
    5: 0    R/W    dmatdl                  0x0
    31: 6   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t dmatdl: 6;
        const uint32_t reserved_0: 26;
    } b;
} DBIC_DMATDLR_TypeDef;



/* 0x54
    2: 0    R/W    dmardl                  0x0
    31: 3   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t dmardl: 3;
        const uint32_t reserved_0: 29;
    } b;
} DBIC_DMARDLR_TypeDef;



/* 0x58
    31:0    R      idcode                  0x303FF01
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t idcode: 32;
    } b;
} DBIC_IDR_TypeDef;



/* 0x5C
    31:0    R      spic_version            0x30530
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t spic_version: 32;
    } b;
} DBIC_SPIC_VERSION_TypeDef;



/* 0x60
    31:0    R/W    dr                      0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t dr: 32;
    } b;
} DBIC_DR_TypeDef;



/* 0xA0
    0       W      data_mask_dr            0x0
    1       W      data_en_dr              0x0
    31: 2   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t data_mask_dr: 1;
        uint32_t data_en_dr: 1;
        const uint32_t reserved_0: 30;
    } b;
} DBIC_DM_DR_TypeDef;




/* 0xE0
    15: 0   R/W    frd_cmd                 0x0B0B
    31: 16  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t frd_cmd: 16;
        const uint32_t reserved_0: 16;
    } b;
} DBIC_READ_FAST_SINGLE_TypeDef;



/* 0xE4
    7: 0    R/W    rd_dual_o_cmd           0x3B
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rd_dual_o_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_READ_DUAL_DATA_TypeDef;



/* 0xE8
    7: 0    R/W    rd_dual_io_cmd          0xBB
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rd_dual_io_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_READ_DUAL_ADDR_DATA_TypeDef;



/* 0xEC
    7: 0    R/W    rd_quad_o_cmd           0x6B
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rd_quad_o_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_READ_QUAD_DATA_TypeDef;



/* 0xF0
    7: 0    R/W    rd_quad_io_cmd          0xEB
    15: 8   R      exit_prm_dum_len        0x0
    23: 16  R/W    prm_val                 0xA5
    31: 24  R      exit_prm_cmd            0xFF
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rd_quad_io_cmd: 8;
        const uint32_t exit_prm_dum_len: 8;
        uint32_t prm_val: 8;
        const uint32_t exit_prm_cmd: 8;
    } b;
} DBIC_READ_QUAD_ADDR_DATA_TypeDef;



/* 0xF4
    15: 0   R/W    wr_cmd                  0x0202
    31: 16  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_cmd: 16;
        const uint32_t reserved_0: 16;
    } b;
} DBIC_WRITE_SINGLE_TypeDef;



/* 0xF8
    7: 0    R/W    wr_dual_i_cmd           0xA2
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_dual_i_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_WRITE_DUAL_DATA_TypeDef;



/* 0xFC
    7: 0    R/W    wr_dual_ii_cmd          0x0
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_dual_ii_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_WRITE_DUAL_ADDR_DATA_TypeDef;



/* 0x100
    7: 0    R/W    wr_quad_i_cmd           0x32
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_quad_i_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_WRITE_QUAD_DATA_TypeDef;



/* 0x104
    7: 0    R/W    wr_quad_ii_cmd          0x38
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_quad_ii_cmd: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_WRITE_QUAD_ADDR_DATA_TypeDef;



