realmcu/HoneyRepo-driver-display/driver/lcdc/device/src/rtl8773e/rtl_lcdc_dbic_def.h
/* 0x108
    7: 0    R/W    wr_en_cmd_1st_byte      0x06
    15: 8   R/W    wr_en_cmd_2nd_byte      0x06
    31: 16  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_en_cmd_1st_byte: 8;
        uint32_t wr_en_cmd_2nd_byte: 8;
        const uint32_t reserved_0: 16;
    } b;
} DBIC_WRITE_ENABLE_TypeDef;



/* 0x10C
    7: 0    R/W    rd_st_cmd_1st_byte      0x05
    15: 8   R/W    rd_st_cmd_2nd_byte      0x05
    23: 16  R/W    rd_st_cmd_3rd_byte      0x0
    24      R      reserved                0x0
    25      R/W    st_cmd_ddr_en           0x0
    27:26   R/W    st_cmd_ch               0x0
    29:28   R/W    st_cmd_len              0x1
    30      R/W    interval_odd            0x0
    31      R/W    interval_en             0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rd_st_cmd_1st_byte: 8;
        uint32_t rd_st_cmd_2nd_byte: 8;
        uint32_t rd_st_cmd_3rd_byte: 8;
        const uint32_t reserved_0: 1;
        uint32_t st_cmd_ddr_en: 1;
        uint32_t st_cmd_ch: 2;
        uint32_t st_cmd_len: 2;
        uint32_t interval_odd: 1;
        uint32_t interval_en: 1;
    } b;
} DBIC_READ_STATUS_TypeDef;



/* 0x110
    0       R/W    so_dnum                 0x1
    1       R/W    wpn_set                 0x0
    2       R/W    wpn_dnum                0x0
    3       R/W    dr_fixed                0x0
    7: 4    R/W    tx_fifo_entry           0x6
    11: 8   R/W    rx_fifo_entry           0x3
    12      R/W    dm_act                  0x1
    13      R/W    full_wr                 0x1
    14      R/W    dis_dm_ca               0x0
    15      R/W    dis_wrap_align          0x0
    31: 16  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t so_dnum: 1;
        uint32_t wpn_set: 1;
        uint32_t wpn_dnum: 1;
        uint32_t dr_fixed: 1;
        uint32_t tx_fifo_entry: 4;
        uint32_t rx_fifo_entry: 4;
        uint32_t dm_act: 1;
        uint32_t full_wr: 1;
        uint32_t dis_dm_ca: 1;
        uint32_t dis_wrap_align: 1;
        const uint32_t reserved_0: 16;
    } b;
} DBIC_CTRLR2_TypeDef;



/* 0x114
    11: 0   R/W    fsckdv                  0x01
    31: 12  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t fsckdv: 12;
        const uint32_t reserved_0: 20;
    } b;
} DBIC_FBAUDR_TypeDef;



/* 0x118
    11: 0   R/W    user_rd_dummy_length    0x0
    13: 12  R/W    user_cmd_lenght         0x0
    15: 14  R      reserved2               0x0
    19: 16  R/W    user_addr_length        0x3
    31: 20  R      reserved1               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t user_rd_dummy_length: 12;
        uint32_t user_cmd_length: 2;
        const uint32_t reserved_1: 2;
        uint32_t user_addr_length: 4;
        const uint32_t reserved_0: 12;
    } b;
} DBIC_USER_LENGTH_TypeDef;



/* 0x11C
    11: 0   R/W    rd_dummy_length         0x0
    15: 12  R/W    in_physical_cyc         0x0
    19: 16  R/W    auto_addr_length        0x3
    27: 20  R/W    rdsr_dummy_length       0x0
    31: 28  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rd_dummy_length: 12;
        uint32_t in_physical_cyc: 4;
        uint32_t auto_addr_length: 4;
        uint32_t rdsr_dummy_length: 8;
        const uint32_t reserved_0: 4;
    } b;
} DBIC_AUTO_LENGTH_TypeDef;



/* 0x120
    0       R/W    frd_single              0x0
    1       R/W    rd_dual_i               0x0
    2       R/W    rd_dual_io              0x0
    3       R/W    rd_quad_o               0x0
    4       R/W    rd_quad_io              0x0
    5       R/W    wr_dual_i               0x0
    6       R/W    wr_dual_ii              0x0
    7       R/W    wr_quad_i               0x0
    8       R/W    wr_quad_ii              0x0
    9       R/W    rm_rdsr                 0x0
    10      R/W    rm_wen                  0x0
    11      R/W    prm_en                  0x0
    12      R/W    ctrlr0_ch               0x0
    13      R/W    dum_en                  0x0
    14      R/W    seq_rd_en               0x1
    15      R/W    seq_wr_en               0x0
    31: 16  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t frd_single: 1;
        uint32_t rd_dual_i: 1;
        uint32_t rd_dual_io: 1;
        uint32_t rd_quad_o: 1;
        uint32_t rd_quad_io: 1;
        uint32_t wr_dual_i: 1;
        uint32_t wr_dual_ii: 1;
        uint32_t wr_quad_i: 1;
        uint32_t wr_quad_ii: 1;
        uint32_t rm_rdsr: 1;
        uint32_t rm_wen: 1;
        uint32_t prm_en: 1;
        uint32_t ctrlr0_ch: 1;
        uint32_t dum_en: 1;
        uint32_t seq_rd_en: 1;
        uint32_t seq_wr_en: 1;
        const uint32_t reserved_0: 16;
    } b;
} DBIC_VALID_CMD_TypeDef;



/* 0x124
    3: 0    R/W    flash_size              0xD
    31: 4   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t flash_size: 4;
        const uint32_t reserved_0: 28;
    } b;
} DBIC_FLASH_SIZE_TypeDef;



/* 0x128
    0       W      flush_all               0x0
    1       W      flush_dr_fifo           0x0
    2       W      flush_st_fifo           0x0
    31: 3   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t flush_all: 1;
        uint32_t flush_dr_fifo: 1;
        uint32_t flush_st_fifo: 1;
        const uint32_t reserved_0: 29;
    } b;
} DBIC_FLUSH_FIFO_TypeDef;



/* 0x12C
    7: 0    R/W    dum_byte_val            0x00
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t dum_byte_val: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_DUM_BYTE_TypeDef;



/* 0x130
    23: 0   R/W    tx_ndf                  0x00
    31: 24  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t tx_ndf: 24;
        const uint32_t reserved_0: 8;
    } b;
} DBIC_TX_NDF_TypeDef;



