realmcu/HoneyRepo-driver-display/driver/lcdc/device/src/rtl8773e/rtl_lcdc_dbic_def.h
/* 0x134
    3: 0    R/W    page_size               0x08
    4       R/W    wr_page_en              0x1
    5       R/W    rd_page_en              0x0
    6       R/W    atom_size               0x0
    7       R      reserved2               0x0
    8       R/W    nor_flash               0x1
    9       R/W    nand_flash              0x0
    10      R/W    psram                   0x0
    11      R/W    jedec_p2cmf             0x0
    12      R/W    data_unit_2b            0x0
    31: 13  R      reserved1               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t page_size: 4;
        uint32_t wr_page_en: 1;
        uint32_t rd_page_en: 1;
        uint32_t atom_size: 1;
        const uint32_t reserved_1: 1;
        uint32_t nor_flash: 1;
        uint32_t nand_flash: 1;
        uint32_t psram: 1;
        uint32_t jedec_p2cmf: 1;
        uint32_t data_unit_2b: 1;
        const uint32_t reserved_0: 19;
    } b;
} DBIC_DEVICE_INFO_TypeDef;



/* 0x138
    5: 0    R/W    cs_h_rd_dum_len         0x30
    11: 6   R/W    cs_h_wr_dum_len         0x30
    15: 12  R/W    cs_active_hold          0x00
    23: 16  R/W    cs_seq_timeout          0x10
    31: 24  R/W    cs_tcem                 0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t cs_h_rd_dum_len: 6;
        uint32_t cs_h_wr_dum_len: 6;
        uint32_t cs_active_hold: 4;
        uint32_t cs_seq_timeout: 8;
        uint32_t cs_tcem: 8;
    } b;
} DBIC_TPR0_TypeDef;



/* 0x13C
    11: 0   R/W    wr_dummy_length         0x0
    31: 12  R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t wr_dummy_length: 12;
        const uint32_t reserved_0: 20;
    } b;
} DBIC_AUTO_LENGTH2_TypeDef;



/* 0x140
    3:0     R/W    cr_active_setup         0x1
    7:4     R      reserved2               0x0
    15:8    R/W    cr_idle_window          0x10
    23:16   R/W    cr_tpwr                 0x40
    31:24   R      reserved1               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t cr_active_setup: 4;
        const uint32_t reserved_1: 4;
        uint32_t cr_idle_window: 8;
        uint32_t cr_tpwr: 8;
        const uint32_t reserved_0: 8;
    } b;
} DBIC_TPR1_TypeDef;



/* 0x180
    7:0     R      st_dr                   0x0
    31: 8   R      reserved                0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t st_dr: 8;
        const uint32_t reserved_0: 24;
    } b;
} DBIC_ST_DR_TypeDef;



/* 0x1C0
    2: 0    R     stflr                  0x0
    31: 3   R      reserved               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t stflr: 3;
        const uint32_t reserved: 29;
    } b;
} DBIC_STFLR_TypeDef;



/* 0x1D0
    7: 0    R/W    page_rd_cmd             0x13
    15: 8   R      reserved2               0x0
    17: 16  R/W    page_rd_ch              0x0
    19: 18  R/W    page_rd_addr_len        0x3
    31: 20  R      reserved1               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t page_rd_cmd: 8;
        const uint32_t reserved_1: 8;
        uint32_t page_rd_ch: 2;
        uint32_t page_rd_addr_len: 2;
        const uint32_t reserved_0: 12;
    } b;
} DBIC_PAGE_READ_TypeDef;


#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL_DBIC_DEF_H */
